app/controllers/api/posts_controller.rb

  def index
    respond_with Post.all
---
SELECT `posts`.* FROM `posts`

  def create
    respond_with Post.create!(post_params)
---
INSERT INTO `posts` (`author`, `body`, `created_at`, `title`, `updated_at`) VALUES ('asdf', 'fdafsad', '2014-03-25 21:00:57', 'fdasfsa', '2014-03-25 21:00:57')