app/controllers/posts_controller.rb

INSERT INTO `posts` (`author`, `content`, `created_at`, `title`, `updated_at`) VALUES ('john doe', 'loremLorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod\r\ntempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam,\r\nquis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo\r\nconsequat. Duis aute irure dolor in reprehenderit in voluptate velit esse\r\ncillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non\r\nproident, sunt in culpa qui officia deserunt mollit anim id est laborum.', '2014-03-25 18:09:01', 'Awrsome title', '2014-03-25 18:09:01')
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save